upgrade-to-lucid-lynx-problem/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-05-26 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Upgrade to Lucid Lynx problems</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="../pdn.css" type="text/css"/>
<link rel='stylesheet' href='https://use.fontawesome.com/releases/v5.8.2/css/all.css' integrity='sha384-oS3vJWv+0UjzBfQzYUhtDYW+Pj2yciDJxpsK1OYPAYjqT085Qq/1cq5FLXAZQ7Ay' crossorigin='anonymous'>
</head>
<body>
<div id="preamble" class="status">
<div class='cover'>
<div class='cover-card'>
<div class='author-name'>Boško Ivanišević</div>
<div class='author-job'>Developer, Theoretical Physicist</div>
<div class='author-bio mbm'>Ruby, JavaScript, Elixir, C++ and few more</div>
<nav id='sidenav' clas='nav'>
<ul class='nav-list'>
<li class='nav-item'><a href='../index.html'>Home</a1> <span>/</span></li>
<li class='nav-item'><a href='../about.html'>About</a> <span>/</span></li>
</ul>
</nav>
<div class='social-links'>
<ul>
<li><a href='https://twitter.com/boskoivanisevic' class='social-link-item' target='_blank'>
<i class='fab fa-twitter'></i>
</a></li>
<li><a href='https://linkedin.com/in/boskoivanisevic' class='social-link-item' target='_blank'>
<i class='fab fa-linkedin'></i>
</a></li>
<li><a href='https://github.com/bosko' class='social-link-item' target='_blank'>
<i class='fab fa-github'></i>
</a></li>
<li><a href='https://stackoverflow.com/users/1665470/boško-ivanišević' class='social-link-item' target='_blank'>
<i class='fab fa-stack-overflow'></i>
</a></li>
<li><a href='https://dev.to/bosko' class='social-link-item' target='_blank'>
  <i class='fab fa-dev' title='bosko's DEV Profile'></i>
</a></li>
</ul>
</div>
</div>
</div>
</div>
<main id="content">
<header>
<h1 class="title">Upgrade to Lucid Lynx problems</h1>
<p class="subtitle">2010-05-16</p>
</header><p>
After several successful updates of Ubuntu (starting from 8.10) last
one was, more or less, complete mess. I was waiting impatiently for
new Lucid Lynx to be released and started update as soon as I
downloaded and burned DVD iso image. It seems everything goes smoothly
till first reboot. Emacs was completely removed and new version was
not installed. On my Compaq 8710w laptop with Quadro FX 1600M graphics
card splash screen was displayed in low resolution and looked quite
ugly. Moreover I was not able to install Emacs again.
</p>

<p>
I’ve decided to reinstall everything, so I’ve made backup of my home
folder and start installation on a newly formatted
partitions. Situation was a little bit better. I was able to install
Emacs and all applications I need but problem with graphics card was
still there as well as lousy splash screen. I’ve found few suggestions
how to fix that by altering grub files and it really solved resolution
problem but, at the same time, whole splash screen was shifted left
and basically I was again on the beginning.
</p>

<p>
There is one more thing that annoyed me. I like Shere Khan Black Hand
mouse pointers so I’ve installed that theme, but arrow pointer was
still white, although some other pointers were changed (hand is small
and black). Whatever I’ve tried arrow was keep staying white.
</p>

<p>
Then, after a few days, I saw black arrow and was really surprised. It
turned out that it was unpleasant surprise because compiz stopped
working and Nvidia driver was not enabled. Obviously it was time to
try latest Nvidia drivers so I’ve downloaded and installed them. I
must say that situation is now a little bit better - compiz is
working, but I still have no luck with mouse pointers, nor with splash
screen.
</p>

<p>
If Canonical’s goal is to increase number of Ubuntu users, they should
really try to avoid such problems, since average user will certainly
not be able to fix them and will switch to some other operating
system.
</p>
</main>
</body>
</html>
